# StructuralFloorCoreThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralFloorCoreThickness Property
ParameterTypeId Class See Also
---
"Core Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralFloorCoreThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralFloorCoreThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralFloorCoreThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace